{
  "version": "1.6.1",
  "releaseDate": "2024-12-28",
  "downloadUrl": "/downloads/KRTJ-Desktop-Setup-1.6.1.exe",
  "releaseNotes": {
    "title": "KRTJ Desktop v1.6.1 - Critical Bug Fixes & Enhanced Reliability! 🔧⚡",
    "features": [
      "NEW: Completely rebuilt IPC communication system for tray menu navigation",
      "NEW: Enhanced TypeScript support with proper electronAPI type definitions",
      "NEW: Improved preload script with proper cleanup functions",
      "NEW: Reliable update restart mechanism with batch script automation",
      "NEW: Enhanced TradingView widget loading with error recovery",
      "NEW: Comprehensive error handling across all components"
    ],
    "improvements": [
      "Completely rewritten tray menu system with reliable navigation",
      "Enhanced IPC bridge between main and renderer processes",
      "Improved TypeScript integration eliminating compilation errors",
      "Better error handling for TradingView widgets with loading states", 
      "More reliable update installation with automatic app restart",
      "Enhanced memory management with proper event listener cleanup"
    ],
    "bugFixes": [
      "FIXED: Update system now properly restarts the application after installation",
      "FIXED: Economic Calendar and Crypto Screener widgets now load correctly with proper error handling",
      "FIXED: Tray menu items (New Trade Entry, Check Prices, Vision Board) now function correctly",
      "FIXED: Application identifier spelling corrected from 'KinforkRepublic' to 'KinsfolkRepublic'",
      "FIXED: Enhanced TradingView widget loading with loading indicators and error states",
      "FIXED: Navigation system improved with proper IPC communication between processes",
      "Resolved component inconsistencies between web and desktop versions",
      "Fixed potential memory leaks in long-running sessions",
      "Enhanced compatibility with latest Electron security features"
    ],
    "notes": "Critical bug fix release! This version specifically addresses tray menu navigation issues, IPC communication problems, and update restart functionality. All reported issues from v1.6.0 testing have been resolved. 🚀"
  },
  "minimumVersion": "1.0.0",
  "isRequired": false,
  "fileSize": "74.4 MB",
  "checksum": "2E67BB99F2EB55256EBDF0855F5D6EB3A3D95725B18AFAEB823C2106D9C4C91F"
}