{
  "version": "1.6.4",
  "releaseDate": "2024-12-28",
  "downloadUrl": "/downloads/KRTJ-Desktop-Setup-1.6.4.exe",
  "releaseNotes": {
    "title": "KRTJ Desktop v1.6.4 - Economic Calendar Height Fixed! 📊📈",
    "features": [
      "CRITICAL FIX: Economic Calendar now displays at proper full height (600px minimum)",
      "FIXED: TradingView widget height configuration set to explicit pixel values", 
      "IMPROVED: Economic Calendar container styling with min-height enforcement",
      "ENHANCED: Widget container now properly enforces height dimensions",
      "OPTIMIZED: Calendar widget fills the entire allocated container space",
      "RESOLVED: Small calendar display issue completely eliminated"
    ],
    "improvements": [
      "Completely rewritten tray menu system with reliable navigation",
      "Enhanced IPC bridge between main and renderer processes",
      "Improved TypeScript integration eliminating compilation errors",
      "Better error handling for TradingView widgets with loading states", 
      "More reliable update installation with automatic app restart",
      "Enhanced memory management with proper event listener cleanup"
    ],
    "bugFixes": [
      "CRITICAL FIX: Economic Calendar size issue - widget now uses proper 600px minimum height",
      "FIXED: TradingView widget configuration updated with explicit height: 600 pixels",
      "FIXED: Container styling enhanced with min-height enforcement (650px container, 600px widget)",
      "RESOLVED: Economic Calendar no longer displays as small compressed widget",
      "IMPROVED: Widget container forces proper dimensions with inline styling",
      "ENHANCED: Calendar display now matches expected full-size appearance",
      "OPTIMIZED: Container CSS classes and inline styles work together for proper sizing",
      "FIXED: Calendar widget properly utilizes allocated screen real estate"
    ],
    "notes": "Emergency fix for Economic Calendar height! The calendar widget was displaying too small - now forces proper 600px minimum height with container styling and explicit TradingView widget dimensions. 📊✨"
  },
  "minimumVersion": "1.0.0",
  "isRequired": false,
  "fileSize": "74.4 MB",
  "checksum": "2E67BB99F2EB55256EBDF0855F5D6EB3A3D95725B18AFAEB823C2106D9C4C91F"
}